In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels  = ['a','b','c']

In [4]:
my_data = [10,20,30]

In [5]:
arr = np.array(my_data)

In [6]:
d = {'a':10,"b":20,"c":30}

In [10]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data = my_data,index =labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [17]:
pd.Series(labels,my_data)

10    a
20    b
30    c
dtype: object

In [20]:
ser1  = pd.Series([1,2,3,4], ["ussa","srk","ndis","oo"])

#

In [21]:
ser1

ussa    1
srk     2
ndis    3
oo      4
dtype: int64

In [23]:
ser1["ussa"]

1

In [24]:
from numpy.random import randn

In [25]:

np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','x','Y','Z'])

In [27]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
type(df['W'])

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [37]:
df[['W','x']]

          W         x
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [38]:
dp = pd.DataFrame(randn(3,4))

In [39]:
dp

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646

In [40]:
df['new']= df['W']+df['Y']

In [41]:
df

          W         x         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [45]:
df.drop('new',axis = 1,inplace = True)

In [46]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df.drop('E',axis =0 , inplace =True)

In [48]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [49]:
df.shape

(4, 4)

In [50]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
df.loc['A']

W    2.706850
x    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [53]:
df.iloc[2]

W   -2.018168
x    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [54]:
df.iloc[3]

W    0.188695
x   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [55]:
df.loc['B',"Y"]

-0.8480769834036315

In [57]:
df.loc['C','Y']

0.5288134940893595

In [59]:
df.loc[['A',"B"],["x","Y"]]

          x         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [60]:
a = "apple"

In [69]:
p = a.find('p')

In [62]:
q = a.find('f')

In [63]:
r = a.find('')

In [71]:
print(q)

-1

In [72]:
df > 0

       W      x      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [73]:
bool =df>0

In [74]:
bool

       W      x      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [75]:
df[bool]

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [76]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [77]:
df[df>0]

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [78]:
df['W']>0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [79]:
df[df['W']>0]

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [80]:
df[df["Z"]<0]

          W         x         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [85]:
 g = df[df["W"]>0]

In [86]:
g["x"]

A    0.628133
B   -0.319318
D   -0.758872
Name: x, dtype: float64

In [87]:
b = df["W"]>0

In [88]:
b

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [89]:
df

          W         x         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [90]:
 df.reset_index()

  index         W         x         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057